from config import OWNER_USERNAME, SUPPORT_GRP
from NoxxNetwork import NoxxBot

START = f"""
<b>👋 ʜᴇʏ! ɪ'ᴍ [{NoxxBot.name}](t.me/{NoxxBot.username})</b>  
<b>🤖 ᴀɴ ᴀɪ-ᴘᴏᴡᴇʀᴇᴅ ᴄʜᴀᴛʙᴏᴛ 🚀</b>  

<b>✨ ᴜsᴀɢᴇ: /chatbot [on/off]</b>  
<b>🔘 ᴛᴀᴘ ᴏɴ ʜᴇʟᴘ ʙᴜᴛᴛᴏɴ ғᴏʀ ᴍᴏʀᴇ ɪɴғᴏ 💡</b>  
"""

HELP_READ = f"""
📚 <u><b>ʜᴇʟᴘ ᴍᴇɴᴜ ғᴏʀ {NoxxBot.name}</b></u>  

<b>⚡ ᴜsᴇ ᴀʟʟ ᴄᴏᴍᴍᴀɴᴅs ᴡɪᴛʜ /</b>  

<b>🛠️ ᴍᴀɪɴ ғᴇᴀᴛᴜʀᴇs:</b>  
<b>- 💬 /chatbot on → ᴇɴᴀʙʟᴇ ᴀɪ ᴄʜᴀᴛ</b>  
<b>- 🔇 /chatbot off → ᴅɪsᴀʙʟᴇ ᴀɪ ᴄʜᴀᴛ</b>  

<b>👑 ᴏᴡɴᴇʀ: @{OWNER_USERNAME}</b>  
"""

TOOLS_DATA_READ = f"""
🛠️ <u><b>ᴛᴏᴏʟs ғᴏʀ {NoxxBot.name}</b></u>  

<b>📂 /repo → ɢᴇᴛ sᴏᴜʀᴄᴇ ᴄᴏᴅᴇ</b>  
<b>📡 /ping → ᴄʜᴇᴄᴋ ᴘɪɴɢ</b>  
<b>🆔 /id → ɢᴇᴛ ᴜsᴇʀ ɪᴅ, ᴄʜᴀᴛ ɪᴅ & ᴍᴇssᴀɢᴇ ɪᴅ</b>  

<b>👑 ᴏᴡɴᴇʀ: @{OWNER_USERNAME}</b>  
"""

CHATBOT_READ = f"""
🤖 <u><b>ᴄʜᴀᴛʙᴏᴛ ᴄᴏᴍᴍᴀɴᴅs</b></u>  

<b>💬 /chatbot on → ᴇɴᴀʙʟᴇ ᴀɪ</b>  
<b>🔇 /chatbot off → ᴅɪsᴀʙʟᴇ ᴀɪ</b>  

<b>⚠️ ɴᴏᴛᴇ: ᴛʜɪs ᴄᴏᴍᴍᴀɴᴅ ᴡᴏʀᴋs ᴏɴʟʏ ɪɴ ɢʀᴏᴜᴘs!</b>  

<b>👑 ᴏᴡɴᴇʀ: @{OWNER_USERNAME}</b>  
"""

SOURCE_READ = f"""
💻 <b>sᴏᴜʀᴄᴇ ᴏғ [{NoxxBot.name}](https://t.me/{NoxxBot.username})</b>  

<b>🌟 ғᴏʀᴋ & sᴛᴀʀ → [GitHub Repo](https://github.com/adarsh001dot/Vip-Chat-Bot)</b>  

<b>❓ ɢᴏᴛ ᴀɴʏ ɪssᴜᴇ? → [sᴜᴘᴘᴏʀᴛ ᴄʜᴀᴛ](https://t.me/{SUPPORT_GRP})</b>  

<b>👑 ᴏᴡɴᴇʀ: @{OWNER_USERNAME}</b>  
"""

ADMIN_READ = "<b>⚙️ ᴀᴅᴍɪɴ ғᴇᴀᴛᴜʀᴇs ᴄᴏᴍɪɴɢ sᴏᴏɴ... 🔜</b>"

ABOUT_READ = f"""
ℹ️ <u><b>ᴀʙᴏᴜᴛ {NoxxBot.name}</b></u>  

<b>🤖 ᴀɴ ᴀɪ-ʙᴀsᴇᴅ ᴄʜᴀᴛʙᴏᴛ</b>  
<b>💬 ᴀᴜᴛᴏ-ʀᴇᴘʟɪᴇs ᴛᴏ ᴜsᴇʀs</b>  
<b>👥 ʜᴇʟᴘs ɪɴ ɢʀᴏᴜᴘ ᴀᴄᴛɪᴠɪᴛʏ</b>  

<b>👇 ᴜsᴇ ᴛʜᴇ ʙᴜᴛᴛᴏɴs ʙᴇʟᴏᴡ ғᴏʀ ᴍᴏʀᴇ ɪɴғᴏ</b>  
"""
